Importando Bibliotecas + Dataset

In [6]:
import pandas as pd
import numpy as np

df_salario = pd.read_csv('Salario/HR_Data_MNC_Data Science Lovers.csv', encoding='latin1')

In [7]:
df_salario.head()

,Unnamed: 0,Employee_ID,Full_Name,Department,Job_Title,Hire_Date,Location,Performance_Rating,Experience_Years,Status,Work_Mode,Salary_INR
0,0,EMP0000001,Joshua Nguyen,IT,Software Engineer,2011-08-10,"Isaacland, Denmark",5,14,Resigned,On-site,1585363
1,1,EMP0000002,Julie Williams,Marketing,SEO Specialist,2018-03-02,"Anthonyside, Costa Rica",2,7,Active,On-site,847686
2,2,EMP0000003,Alyssa Martinez,HR,HR Manager,2023-03-20,"Port Christinaport, Saudi Arabia",1,2,Active,On-site,1430084
3,3,EMP0000004,Nicholas Valdez,IT,Software Engineer,2023-10-12,"Port Shelbychester, Antigua and Barbuda",1,1,Active,On-site,990689
4,4,EMP0000005,Joel Hendricks,Operations,Logistics Coordinator,2024-12-09,"Lake Kimberly, Palestinian Territory",5,0,Active,On-site,535082

In [8]:
df_salario.describe()

         Unnamed: 0  Performance_Rating  Experience_Years    Salary_INR
count  2.000000e+06        2.000000e+06      2.000000e+06  2.000000e+06
mean   9.999995e+05        3.000148e+00      5.010287e+00  8.968878e+05
std    5.773504e+05        1.413973e+00      3.608823e+00  4.026103e+05
min    0.000000e+00        1.000000e+00      0.000000e+00  3.000000e+05
25%    4.999998e+05        2.000000e+00      2.000000e+00  6.163460e+05
50%    9.999995e+05        3.000000e+00      5.000000e+00  8.110265e+05
75%    1.499999e+06        4.000000e+00      8.000000e+00  1.073745e+06
max    1.999999e+06        5.000000e+00      1.500000e+01  2.999976e+06